#+TITLE: Determinization and Minimization of Non-Deterministic Finite State Automatas - A Distributed Approach
#+AUTHOR: A. Guerville



#+LATEX_HEADER: \usepackage{fancyhdr}
#+LATEX_HEADER: \usepackage[a4paper, total={6in, 8in}]{geometry}
#+LATEX_HEADER: \usepackage{fontspec}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{tikz}
#+LATEX_HEADER: \usepackage{array}
#+LATEX_HEADER: \usetikzlibrary{automata, positioning, arrow}
#+LATEX_HEADER: \usepackage{algorithm}
#+LATEX_HEADER: \usepackage{amsthm}
#+LATEX_HEADER: \usepackage{algpseudocode}
#+LATEX_HEADER: \pagestyle{fancy}
#+LATEX_HEADER: \fancyhf{}
#+LATEX_HEADER: \lhead{Determinization and Minimization of Non-Deterministic NFAs - A Distributed Approach}
#+LATEX_HEADER: \fancyfoot[RO, LE] {Page \thepage}


** Comparison of Test Cases
<<parap:testcomp>>
Figure \ref{table:compselfgapaut} shows the evolution of automaton sizes for self-generated buffer and stack TPNs against GAP-generated TPNs. Meanwhile, figure \ref{table:compselfgapseq} A general
observation that can be derived, is that self-generated TPNs are always initially smaller, and take considerably less
time to determinize than GAP-generated TPNs. It can also be observed that the GAP-generated automatas grow in size a lot
quicker than self-generated ones. Furthermore, while the time taken to determinize and minimize self-generated automatas
barely evolves, with an evolution that is within error margin, the time taken for GAP-generated automatas increases
significantly over time.

#+begin_src python :async yes :results value :exports none
import subprocess
import json

arr = [["b", "s", "Initial self-gen", "Initial GAP-gen", "Intermediary self-gen", "Intermediary GAP-gen", "Final self-gen", "Final GAP-gen"]]
for i in range(2, 4):
    for j in range(2, 6):
        # Get self-generated process results
        p = subprocess.run(["./nfdeterminize", "--verbose", "--timed", "--file", "/dev/null", "run", "bns", str(i), str(j)], capture_output=True)
        stdout = p.stdout.decode().split('\n')
        iselfs = int(stdout[0].split(' ')[-1])
        mselfs = int(stdout[1].split(' ')[-1])
        fselfs = int(stdout[2].split(' ')[-1])
        # Get GAP-generated process output

        fp = f"/cs/home/apjg1/Documents/gitrepos/nfdeterminize/automatons/bns-{i}-{j}.nfa"
        p = subprocess.run(["./nfdeterminize", "--verbose", "--timed", "--file", "/dev/null", "run", "file", fp], capture_output=True)
        stdout = p.stdout.decode().split('\n')
        igaps = int(stdout[0].split(' ')[-1])
        mgaps = int(stdout[1].split(' ')[-1])
        fgaps = int(stdout[2].split(' ')[-1])
        arr.append([i, j, iselfs, igaps, mselfs, mgaps, fselfs, fgaps])
return arr
#+end_src

#+RESULTS:


#+NAME: table:compselfgapaut
#+CAPTION: Comparison between self-generated TPNs and GAP-generated TPNs
#+ATTR_LATEX: :align |c|c|| m{4em} | m{4em} | m{4em} | m{4em} | m{4em} | m{4em} |
|---+---+------------------+-----------------+-----------------------+----------------------+----------------+---------------|
| b | s | Initial self-gen | Initial GAP-gen | Intermediary self-gen | Intermediary GAP-gen | Final self-gen | Final GAP-gen |
|---+---+------------------+-----------------+-----------------------+----------------------+----------------+---------------|
|---+---+------------------+-----------------+-----------------------+----------------------+----------------+---------------|
| 2 | 2 |               18 |              82 |                     3 |                    3 |              3 |             3 |
| 2 | 3 |               38 |             244 |                     8 |                    8 |              8 |             8 |
| 2 | 4 |               78 |             730 |                    16 |                   16 |             16 |            16 |
| 2 | 5 |              158 |            2188 |                    32 |                   32 |             32 |            32 |
| 3 | 2 |               39 |             460 |                     4 |                    4 |              4 |             4 |
| 3 | 3 |              117 |            1826 |                    13 |                   13 |             13 |            13 |
| 3 | 4 |              351 |            7288 |                    33 |                   33 |             33 |            33 |
| 3 | 5 |             1053 |           29134 |                    85 |                   85 |             85 |            85 |
|---+---+------------------+-----------------+-----------------------+----------------------+----------------+---------------|

#+begin_src python :async yes :results value :exports none
import subprocess
import json

arr = [["b", "s", "self-generated determinize", "GAP-generated determinize", "self-generated minimize", "GAP-generated minimize"]]
fp_orig = "/cs/home/apjg1/Documents/gitrepos/nfdeterminize/target/criterion"
estim_loc = "base/estimates.json"
for i in range(2, 4):
    for j in range(2, 6):
        t_selfs = 0.0
        t_selfm = 0.0
        with open(f"{fp_orig}/determinize bns {i} {j} Sequential/{estim_loc}") as f:
           estimates = json.load(f)
           t_selfs = float (estimates["mean"]["point_estimate"]) / 1000
        with open(f"{fp_orig}/minimize bns {i} {j} Sequential/{estim_loc}") as f:
           estimates = json.load(f)
           t_selfm = float (estimates["mean"]["point_estimate"]) / 1000
        # Get GAP-generated process output

        t_gaps = 0.0
        t_gapm = 0.0
        with open(f"{fp_orig}/determinize file bns {i} {j} Sequential/{estim_loc}") as f:
           estimates = json.load(f)
           t_gaps = float (estimates["mean"]["point_estimate"]) / 1000
        with open(f"{fp_orig}/minimize file bns {i} {j} Sequential/{estim_loc}") as f:
           estimates = json.load(f)
           t_gapm += float (estimates["mean"]["point_estimate"]) / 1000
        arr.append([i, j, round(t_selfs, 2), round(t_gaps, 2), round(t_selfm, 2), round(t_gapm, 2)])
return arr
#+end_src

#+RESULTS:
| b | s | self-generated determinize | GAP-generated determinize | self-generated minimize | GAP-generated minimize |
| 2 | 2 |                       5.23 |                      21.5 |                    2.28 |                   2.31 |
| 2 | 3 |                      23.67 |                    116.45 |                    8.14 |                   8.55 |
| 2 | 4 |                      78.21 |                     644.7 |                   20.27 |                  20.07 |
| 2 | 5 |                     284.96 |                    3278.8 |                   47.04 |                   47.5 |
| 3 | 2 |                       16.0 |                    158.57 |                    3.91 |                   3.83 |
| 3 | 3 |                     107.15 |                   1527.34 |                   16.66 |                   17.0 |
| 3 | 4 |                     648.39 |                  13325.41 |                   54.03 |                  54.54 |
| 3 | 5 |                    3320.03 |                  108088.1 |                   184.0 |                 188.63 |

#+NAME: table:compselfgapseq
#+CAPTION: Comparison of time taken on self-generated automats vs GAP-generated ones
#+ATTR_LATEX: :align |c|c||m{4em}|m{4em}|m{4em}|m{4em}|
|---+---+----------------------------+---------------------------+-------------------------+------------------------|
| b | s | self-generated determinize | GAP-generated determinize | self-generated minimize | GAP-generated minimize |
|---+---+----------------------------+---------------------------+-------------------------+------------------------|
|---+---+----------------------------+---------------------------+-------------------------+------------------------|
| 2 | 2 |                       5.23 |                      21.5 |                    2.28 |                   2.31 |
| 2 | 3 |                      23.67 |                    116.45 |                    8.14 |                   8.55 |
| 2 | 4 |                      78.21 |                     644.7 |                   20.27 |                  20.07 |
| 2 | 5 |                     284.96 |                    3278.8 |                   47.04 |                   47.5 |
| 3 | 2 |                       16.0 |                    158.57 |                    3.91 |                   3.83 |
| 3 | 3 |                     107.15 |                   1527.34 |                   16.66 |                   17.0 |
| 3 | 4 |                     648.39 |                  13325.41 |                   54.03 |                  54.54 |
| 3 | 5 |                    3320.03 |                  108088.1 |                   184.0 |                 188.63 |
|---+---+----------------------------+---------------------------+-------------------------+------------------------|
It is possible to establish now that there are only advantages to using the self-generated NFAs instead of the GAP-generated
ones when it comes to researching about token passing networks. However, research of allowed permutations in sequential
stack TPNs is often further simplified to searching about stack and buffer TPNs. The reasoning behind it is that the
produced NFAs are usually less complex than two-stack ones.

=Nfdeterminize= supports the generation of both TPN types. The question is therefore - are buffer and stack TPNs less complex
than two-stack TPNs, and if so, what are the difference between both that lead to such results.

The first difference between two-stack and buffer-and-stack lies in how they are generated. Let's assume that
=nfdeterminize='s NFA generator is used here. The main difference between buffer-and-stack and two-stack is how during
automata generation, on each iteration, at most 1 \(\epsilon\) transition from the first stack to the 2nd stack is made,
while at most \(k\) \(\epsilon\) transitions are made from the buffer to the stack for the buffer and stack automaton.

#+begin_src python :async yes :results value :exports none
import subprocess
import json

arr = [["s1", "s2", "Initial bns", "Initial two-stack", "Intermediary bns", "Intermediary two-stack", "Final bns", "Final two-stack"]]
for i in range(2, 4):
    for j in range(2, 8):
        # Get self-generated process results
        p = subprocess.run(["./nfdeterminize", "--verbose", "--timed", "--file", "/dev/null", "run", "bns", str(i), str(j)], capture_output=True)
        stdout = p.stdout.decode().split('\n')
        ibns = int(stdout[0].split(' ')[-1])
        mbns = int(stdout[1].split(' ')[-1])
        fbns = int(stdout[2].split(' ')[-1])

        p = subprocess.run(["./nfdeterminize", "--verbose", "--timed", "--file", "/dev/null", "run", "two-stack", str(i), str(j)], capture_output=True)
        stdout = p.stdout.decode().split('\n')
        its = int(stdout[0].split(' ')[-1])
        mts = int(stdout[1].split(' ')[-1])
        fts = int(stdout[2].split(' ')[-1])

        arr.append([i, j, ibns, its, mbns, mts, fbns, fts])
return arr
#+end_src

#+RESULTS:
| s1 | s2 | Initial bns | Initial two-stack | Intermediary bns | Intermediary two-stack | Final bns | Final two-stack |
|  2 |  2 |          18 |                18 |                3 |                      3 |         3 |               3 |
|  2 |  3 |          38 |                38 |                8 |                      8 |         8 |               8 |
|  2 |  4 |          78 |                78 |               16 |                     16 |        16 |              16 |
|  2 |  5 |         158 |               158 |               32 |                     32 |        32 |              32 |
|  2 |  6 |         318 |               318 |               64 |                     64 |        64 |              64 |
|  2 |  7 |         638 |               638 |              128 |                    128 |       128 |             128 |
|  3 |  2 |          39 |                36 |                4 |                     10 |         4 |              10 |
|  3 |  3 |         117 |                96 |               13 |                     35 |        13 |              35 |
|  3 |  4 |         351 |               253 |               33 |                    177 |        33 |             177 |
|  3 |  5 |        1053 |               664 |               85 |                   1070 |        85 |            1070 |
|  3 |  6 |        3159 |              1740 |              221 |                   6682 |       221 |            6682 |
|  3 |  7 |        9477 |              4557 |              577 |                  41888 |       577 |           41888 |


#+NAME: table:tsvsbns
#+CAPTION: Automaton size comparison between buffer-and-stack NFAs and Two-stack NFAs
#+ATTR_LATEX: :align |c|c|| m{4em} | m{4em} | m{4em} | m{4em} | m{4em} | m{4em} |
|----+----+-------------+-------------------+------------------+------------------------+-----------+-----------------|
| s1 | s2 | Initial bns | Initial two-stack | Intermediary bns | Intermediary two-stack | Final bns | Final two-stack |
|----+----+-------------+-------------------+------------------+------------------------+-----------+-----------------|
|----+----+-------------+-------------------+------------------+------------------------+-----------+-----------------|
|  2 |  2 |          18 |                18 |                3 |                      3 |         3 |               3 |
|  2 |  3 |          38 |                38 |                8 |                      8 |         8 |               8 |
|  2 |  4 |          78 |                78 |               16 |                     16 |        16 |              16 |
|  2 |  5 |         158 |               158 |               32 |                     32 |        32 |              32 |
|  2 |  6 |         318 |               318 |               64 |                     64 |        64 |              64 |
|  2 |  7 |         638 |               638 |              128 |                    128 |       128 |             128 |
|  3 |  2 |          39 |                36 |                4 |                     10 |         4 |              10 |
|  3 |  3 |         117 |                96 |               13 |                     35 |        13 |              35 |
|  3 |  4 |         351 |               253 |               33 |                    177 |        33 |             177 |
|  3 |  5 |        1053 |               664 |               85 |                   1070 |        85 |            1070 |
|  3 |  6 |        3159 |              1740 |              221 |                   6682 |       221 |            6682 |
|  3 |  7 |        9477 |              4557 |              577 |                  41888 |       577 |           41888 |
|----+----+-------------+-------------------+------------------+------------------------+-----------+-----------------|

Two major remarks can be done from figure \ref{table:tsvsbns}. First, the size of both initial automatas is
very similar, and evolves similarly. On buffer/first stack size \(= 2\), they're even equal. This similarity is an
example of how closely related those 2 TPN patterns are.

Then, from observations of the intermediary DFA sizes for bns and two-stack TPNs on \(s1 = 3\),
it can be seen how much quicker the size of the two-stack TPN increases compared to the size of the buffer-and-stack TPN,
despite how the initial size of the buffer-and-stack TPN was bigger than that of the two-stack TPN. This evolution may be
caused due to how more states in the buffer-and-stack NFA may share the same state in the intermediary DFA, due to the
larger number of \(\epsilon\) transitions. In the end, the increased complexity of two-stack TPNs over buffer-and-stack TPNs is
demonstrated by how much more time

#+NAME: py:tsvsbnstime
#+begin_src python :async yes :results value :exports none
import subprocess
import json

arr = [["-"],["b", "s", "bns determinize", "two-stack determinize", "bns minimize", "two-stack minimize"], ["-"], ["-"]]
fp_orig = "/cs/home/apjg1/Documents/gitrepos/nfdeterminize/target/criterion"
estim_loc = "base/estimates.json"
for i in range(2, 4):
    for j in range(2, 6):
        t_selfs = 0.0
        t_selfm = 0.0
        with open(f"{fp_orig}/determinize bns {i} {j} Sequential/{estim_loc}") as f:
           estimates = json.load(f)
           t_selfs = float (estimates["mean"]["point_estimate"]) / 1000
        with open(f"{fp_orig}/minimize bns {i} {j} Sequential/{estim_loc}") as f:
           estimates = json.load(f)
           t_selfm = float (estimates["mean"]["point_estimate"]) / 1000
        # Get GAP-generated process output

        t_gaps = 0.0
        t_gapm = 0.0
        with open(f"{fp_orig}/determinize ts {i} {j} Sequential/{estim_loc}") as f:
           estimates = json.load(f)
           t_gaps = float (estimates["mean"]["point_estimate"]) / 1000
        with open(f"{fp_orig}/minimize ts {i} {j} Sequential/{estim_loc}") as f:
           estimates = json.load(f)
           t_gapm += float (estimates["mean"]["point_estimate"]) / 1000
        arr.append([i, j, round(t_selfs, 2), round(t_gaps, 2), round(t_selfm, 2), round(t_gapm, 2)])
arr.append(["-"])
return arr
#+end_src

#+NAME: fig:tsvsbnstime
#+CAPTION: Time taken comparison between buffer-and-stack NFAs and two-stack NFAs
#+RESULTS: py:tsvsbnstime

Finally, it is interesting to remark how with the way the powerset construction algorithm is done here, there rarely ever
is a case where DFA minimization ends up minimizing the initial DFA when it comes to token passing networks. Hence the
amount of time that was spent over the determinization algorithm over the minimization algorithm during the development
of =nfdeterminize=.

** Multithreading Against Sequential

Next, we compare the performance of the sequential algorithms against the multithreaded version. It is expected that
the multithreaded have some amount of overhead and that therefore the multithreaded algorithm would perform worse
than its sequential counterpart. However, as the complexity of the NFA/DFA increases, the multithreaded approach would
end up significantly beating the sequential algorithm in time taken.

#+begin_src python :results value :exports none
import subprocess
import json

arr = [["b", "s", "Sequential determinize", "Multithreaded determinize", "Sequential minimize", "Multithreaded minimize"]]
fp_orig = "/cs/home/apjg1/Documents/gitrepos/nfdeterminize/target/criterion"
estim_loc = "base/estimates.json"
for i in range(2, 4):
    for j in range(2, 8):
        t_selfs = 0.0
        t_selfm = 0.0
        with open(f"{fp_orig}/determinize bns {i} {j} Sequential/{estim_loc}") as f:
           estimates = json.load(f)
           t_selfs = float (estimates["mean"]["point_estimate"]) / 1000
        with open(f"{fp_orig}/minimize bns {i} {j} Sequential/{estim_loc}") as f:
           estimates = json.load(f)
           t_selfm = float (estimates["mean"]["point_estimate"]) / 1000
        # Get GAP-generated process output

        t_gaps = 0.0
        t_gapm = 0.0
        with open(f"{fp_orig}/determinize bns {i} {j} Multithreaded(12)/{estim_loc}") as f:
           estimates = json.load(f)
           t_gaps = float (estimates["mean"]["point_estimate"]) / 1000
        with open(f"{fp_orig}/minimize bns {i} {j} Multithreaded(12)/{estim_loc}") as f:
           estimates = json.load(f)
           t_gapm = float (estimates["mean"]["point_estimate"]) / 1000
        arr.append([i, j, round(t_selfs, 2), round(t_gaps, 2), round(t_selfm, 2), round(t_gapm, 2)])
return arr
#+end_src

#+RESULTS:
| b | s | Sequential determinize | Multithreaded determinize | Sequential minimize | Multithreaded minimize |
| 2 | 2 |                   5.23 |                   3725.09 |                2.28 |                   2.54 |
| 2 | 3 |                  23.67 |                   4086.26 |                8.14 |                   8.78 |
| 2 | 4 |                  78.21 |                   3506.48 |               20.27 |                  20.35 |
| 2 | 5 |                 284.96 |                   3704.92 |               47.04 |                  47.63 |
| 2 | 6 |                 882.84 |                   3848.89 |              113.11 |                 114.83 |
| 2 | 7 |                2704.02 |                   5228.54 |              271.61 |                 279.62 |
| 3 | 2 |                   16.0 |                   3296.99 |                3.91 |                    3.9 |
| 3 | 3 |                 107.15 |                   3465.07 |               16.66 |                  17.42 |
| 3 | 4 |                 648.39 |                   4018.34 |               54.03 |                  53.54 |
| 3 | 5 |                3320.03 |                   6020.85 |               184.0 |                  191.4 |
| 3 | 6 |               18929.55 |                  12607.03 |              590.02 |                 614.89 |
| 3 | 7 |              117353.27 |                  43373.57 |             1787.97 |                1849.16 |

#+NAME: table:seqmtcomp
#+CAPTION: Comparison time taken on sequential against multithreaded mode
#+ATTR_LATEX: :align |c|c|| m{4em} | m{4em} | m{4em} | m{4em} |
|---+---+------------------------+---------------------------+---------------------+------------------------|
| b | s | Sequential determinize | Multithreaded determinize | Sequential minimize | Multithreaded minimize |
|---+---+------------------------+---------------------------+---------------------+------------------------|
|---+---+------------------------+---------------------------+---------------------+------------------------|
| 2 | 2 |                   5.23 |                   3725.09 |                2.28 |                   2.54 |
| 2 | 3 |                  23.67 |                   4086.26 |                8.14 |                   8.78 |
| 2 | 4 |                  78.21 |                   3506.48 |               20.27 |                  20.35 |
| 2 | 5 |                 284.96 |                   3704.92 |               47.04 |                  47.63 |
| 2 | 6 |                 882.84 |                   3848.89 |              113.11 |                 114.83 |
| 2 | 7 |                2704.02 |                   5228.54 |              271.61 |                 279.62 |
| 3 | 2 |                   16.0 |                   3296.99 |                3.91 |                    3.9 |
| 3 | 3 |                 107.15 |                   3465.07 |               16.66 |                  17.42 |
| 3 | 4 |                 648.39 |                   4018.34 |               54.03 |                  53.54 |
| 3 | 5 |                3320.03 |                   6020.85 |               184.0 |                  191.4 |
| 3 | 6 |               18929.55 |                  12607.03 |              590.02 |                 614.89 |
| 3 | 7 |              117353.27 |                  43373.57 |             1787.97 |                1849.16 |
|---+---+------------------------+---------------------------+---------------------+------------------------|

Figure \ref{table:seqmtcomp} shows the time taken by the sequential and multithreaded algorithms when running buffer
and stack algorithms. As can be seen, on lower NFA sizes, the sequential algorithm performs much better, probably due
to how much less overhead it has to do before running. However, as the NFA's size increases, the multithreaded algorithm
ends up performing much better.

A general remark to make is that the efficiency of the mulithtreaded algorithm depends on the complexity of the NFA to
determinize against the number of threads being run - and the bigger the NFA is, the more efficient it is to use
more threads. Such an effect may be due to how if given too high a number of threads, and too small an NFA, there may be
uneven spread between states belonging to each thread, and thus an uneven share of loads, while some hash map shards may
spend too much time being concurrently accessed.


